<html>
<head>
    
	<title> GitHub (hist&oacute;ria, criadores, principais funcionalidades e comandos)</title>	
	

</head>
<body>
<h1><P ALIGN="CENTER">GitHub (hist&oacute;ria, criadores, principais funcionalidades e comandos)</P></h1>


<p>GitHub &eacute; um servi&ccedil;o de hospedagem baseado na web para projetos de desenvolvimento de software que usam o sistema
 de controle de revis&atilde;o Git.</p>
 
 <p>GitHub oferece dois planos pagos para reposit&oacute;rios privados e contas gratuitas para 
 projetos de c&oacute;digo aberto.</p>
 
<p> O site foi lan&ccedil;ado em 2008 por Tom Preston-Werner, Chris Wanstrath e PJ Hyett.</p>
 
<p>O site fornece redes sociais funcionalidade, como feeds, seguidores, wikis (usando gollum software Wiki ) e o 
gr&aacute;fico de rede social para mostrar como os desenvolvedores trabalham em suas vers&otilde;es de um reposit&oacute;rio.</p>

<p>GitHub tamb&eacute;m opera outros servi&ccedil;os: a pastebin site de estilo chamado Gist  que fornece wikis para reposit&oacute;rios
 individuais e p&aacute;ginas web que podem ser editados atrav&eacute;s de um reposit&oacute;rio Git, um servi&ccedil;o de hospedagem de slides
 chamado Speaker Deck, e uma an&aacute;lise da web plataforma chamado Gauges.</p> 
 

<p>O software que &eacute; executado GitHub foi escrito usando Ruby on Rails e Erlang por GitHub, Inc. (anteriormente 
conhecido como impressionantes l&oacute;gicos) desenvolvedores Chris Wanstrath, PJ Hyett, e Tom Preston-Werner .</p>

<p>Em 21 de Setembro de 2011, GitHub anunciou que havia alcan&ccedil;ado mais de 1 milh&atilde;o de usu&aacute;rios. </p>

<p>Em 13 de setembro de 2012, em sua homepage, GitHub anunciou que teve mais de 2,1 milh&otilde;es de usu&aacute;rios de
 hospedagem mais de 3,7 milh&otilde;es de reposit&oacute;rios. </p>
 

<p>Em 19 de dezembro de 2012, GitHub anunciou que teve mais de 2,8 milh&otilde;es de usu&aacute;rios de hospedagem mais de
 4,6 milh&otilde;es reposit&oacute;rios. </p>
 

<p>Em 16 de janeiro de 2013, GitHub anunciou que tinha passado os 3 milh&otilde;es de usu&aacute;rios marcam e foi ent&atilde;o
 que hospeda mais de 5 milh&otilde;es de reposit&oacute;rios.</p> 

<p>Em 10 de abril de 2013, GitHub anunciaram que tinha 3,5 milh&otilde;es de usu&aacute;rios e agora hospeda mais de
 6 milh&otilde;es de reposit&oacute;rios. </p>

<p>Em 23 de dezembro de 2013, GitHub anunciaram ter chegado a 10 milh&otilde;es de reposit&oacute;rios. </p>

.

<p>GitHub, Inc. foi fundada em 2008 e est&aacute; sediada em San Francisco, Calif&oacute;rnia. </p>

</body>	
</html>